[Frame_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Blade Frame"
FriendlyNamePlural="Basic Blade Frames"
BriefSummary="Metal components are forged<br/>with a folded and hollow<br/>method to reduce weight<br/>Gain <font color='#3ABD23'>+<Ability:BSCFRAMEMOBBONUS/></font> Mobility."
TinySummary="Increased Mobility"
LootTooltip="This Basic Blade Frame, when installed, will increase a soldier's Mobility by <font color='#3ABD23'>+<Ability:BSCFRAMEMOBBONUS/></font>."

[Frame_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Blade Frame"
FriendlyNamePlural="Advanced Blade Frames"
BriefSummary="Metal components are forged<br/>with a folded and hollow<br/>method to reduce weight<br/>Gain <font color='#3ABD23'>+<Ability:ADVFRAMEMOBBONUS/></font> Mobility."
TinySummary="Increased Mobility"
LootTooltip="This Advanced Blade Frame, when installed, will increase a soldier's Mobility by <font color='#3ABD23'>+<Ability:ADVFRAMEMOBBONUS/></font>."

[Frame_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Blade Frame"
FriendlyNamePlural="Superior Blade Frames"
BriefSummary="Metal components are forged<br/>with a folded and hollow<br/>method to reduce weight<br/>Gain <font color='#3ABD23'>+<Ability:SUPFRAMEMOBBONUS/></font> Mobility."
TinySummary="Increased Mobility"
LootTooltip="This Superior Blade Frame, when installed, will increase a soldier's Mobility by <font color='#3ABD23'>+<Ability:SUPFRAMEMOBBONUS/></font>."

[Sheath_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Scrambler"
FriendlyNamePlural="Basic Scramblers"
BriefSummary="Scabbard device emitting an<br/>EM pulse. The scrambling of<br/>Psionic signals makes you <font color='#3ABD23'><Ability:BSCSHEATHDET/>%</font> harder to detect"
TinySummary="Increased Stealth"
LootTooltip="This Basic Scrambler is installed in the scabbard or sheath of bladed weapons. It decreases a soldier's detection radius by <font color='#3ABD23'>+<Ability:BSCSHEATHDET/>%</font>."

[Sheath_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Scrambler"
FriendlyNamePlural="Advanced Scramblers"
BriefSummary="Scabbard device emitting an<br/>EM pulse. The scrambling of<br/>Psionic signals makes you <font color='#3ABD23'><Ability:ADVSHEATHDET/>%</font> harder to detect"
TinySummary="Increased Stealth"
LootTooltip="This Basic Scrambler is installed in the scabbard or sheath of bladed weapons. It decreases a soldier's detection radius by <font color='#3ABD23'>+<Ability:ADVSHEATHDET/>%</font>."

[Sheath_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Scrambler"
FriendlyNamePlural="Superior Scramblers"
BriefSummary="Scabbard device emitting an<br/>EM pulse. The scrambling of<br/>Psionic signals makes you <font color='#3ABD23'><Ability:SUPSHEATHDET/>%</font> harder to detect"
TinySummary="Increased Stealth"
LootTooltip="This Basic Scrambler is installed in the scabbard or sheath of bladed weapons. It decreases a soldier's detection radius by <font color='#3ABD23'>+<Ability:SUPSHEATHDET/>%</font>."

[Rapier_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Targeting Module"
FriendlyNamePlural="Basic Targeting Modules"
BriefSummary="AI assisted processing unit<br/>automatically detects weak<br/>defensive spots.Your blade<br/>pierces <font color='#3ABD23'><Ability:BSCRAPPIERCE/></font> armor."
TinySummary="Armor Piercing"
LootTooltip="This Basic Targeting Module, when installed, will pierce through <font color='#3ABD23'>+<Ability:BSCRAPPIERCE/></font> layer of enemy armor."

[Rapier_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Targeting Module"
FriendlyNamePlural="Advanced Targeting Modules"
BriefSummary="AI assisted processing unit<br/>automatically detects weak<br/>defensive spots.Your blade<br/>pierces <font color='#3ABD23'><Ability:ADVRAPPIERCE/></font> armor."
TinySummary="Armor Piercing"
LootTooltip="This Advanced Targeting Module, when installed, will pierce through <font color='#3ABD23'>+<Ability:ADVRAPPIERCE/></font> layer of enemy armor."

[Rapier_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Targeting Module"
FriendlyNamePlural="Superior Targeting Modules"
BriefSummary="AI assisted processing unit<br/>automatically detects weak<br/>defensive spots.Your blade<br/>pierces <font color='#3ABD23'><Ability:SUPRAPPIERCE/></font> armor."
TinySummary="Armor Piercing"
LootTooltip="This Superior Targeting Module, when installed, will pierce through <font color='#3ABD23'>+<Ability:SUPRAPPIERCE/></font> layer of enemy armor."

[Pommel_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Pommel Micro Motor"
FriendlyNamePlural="Basic Pommel Micro Motors"
BriefSummary="This small cylinder adds vibrating force to your blade.<br/>Bladestorm deals <font color='#3ABD23'>+<Ability:BSCPOMMELDMG/></font> damage."
TinySummary="Bladestorm boost"
LootTooltip="This Basic Pommel upgrade, when installed, will deal an aditional <font color='#3ABD23'><Ability:BSCPOMMELDMG/></font> damage to any enemy foolish enough to get close."

[Pommel_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Pommel Micro Motor"
FriendlyNamePlural="Advanced Pommel Micro Motors"
BriefSummary="This small cylinder adds vibrating force to your blade.<br/>Bladestorm deals <font color='#3ABD23'>+<Ability:ADVPOMMELDMG/></font> damage."
TinySummary="Bladestorm boost"
LootTooltip="This Advanced Pommel upgrade, when installed, will deal an aditional <font color='#3ABD23'><Ability:ADVPOMMELDMG/></font> damage to any enemy foolish enough to get close."

[Pommel_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Pommel Micro Motor"
FriendlyNamePlural="Superior Pommel Micro Motors"
BriefSummary="This small cylinder adds vibrating force to your blade.<br/>Bladestorm deals <font color='#3ABD23'>+<Ability:SUPPOMMELDMG/></font> damage."
TinySummary="Bladestorm boost"
LootTooltip="This Superior Pommel upgrade, when installed, will deal an aditional <font color='#3ABD23'><Ability:SUPPOMMELDMG/></font> damage to any enemy foolish enough to get close."

[XGuard_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Crossguard Taptic Module"
FriendlyNamePlural="Basic Crossguard Taptic Modules"
BriefSummary="<font color='#3ABD23'>+<Ability:BSCXGDMG/></font> damage to confused, disoriented, stunned, bound, frozen and dazed targets"
TinySummary="+dmg to impaired enemies"
LootTooltip="This Basic Crossguard module deals <font color='#3ABD23'><Ability:BSCXGDMG/></font> additional damage to any enemy suffering from the following conditions: confused, disoriented, stunned, bound, frozen and dazed."

[XGuard_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Crossguard Taptic Module"
FriendlyNamePlural="Advanced Crossguard Taptic Modules"
BriefSummary="<font color='#3ABD23'>+<Ability:ADVXGDMG/></font> damage to confused, disoriented, stunned, bound, frozen and dazed targets"
TinySummary="+dmg to impaired enemies"
LootTooltip="This Advanced Crossguard module deals <font color='#3ABD23'><Ability:ADVXGDMG/></font> additional damage to any enemy suffering from the following conditions: confused, disoriented, stunned, bound, frozen and dazed."

[Xguard_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Crossguard Taptic Module"
FriendlyNamePlural="Superior Crossguard Taptic Modules"
BriefSummary="<font color='#3ABD23'>+<Ability:SUPXGDMG/></font> damage to confused, disoriented, stunned, bound, frozen and dazed targets"
TinySummary="+dmg to impaired enemies"
LootTooltip="This Superior Crossguard module deals <font color='#3ABD23'><Ability:SUPXGDMG/></font> additional damage to any enemy suffering from the following conditions: confused, disoriented, stunned, bound, frozen and dazed."

[Coating_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Pressurized Dispenser"
FriendlyNamePlural="Basic Pressurized Dispensers"
BriefSummary="Trace amounts of toxin coat the blade right before impact.<br/><font color='#3ABD23'>+<Ability:BSCCOATDMG/></font> damage to bleeding, burning, acid-burn and poisoned targets"
TinySummary="+dmg to DOT-suffering enemies"
LootTooltip="This Basic Pressurized Dispenser deals <font color='#3ABD23'><Ability:BSCCOATDMG/></font> additional damage to any enemy suffering from the following conditions: bleeding, burning, acid-burn and poisoned"

[Coating_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Pressurized Dispenser"
FriendlyNamePlural="Advanced Pressurized Dispensers"
BriefSummary="Trace amounts of toxin coat the blade right before impact.<br/><font color='#3ABD23'>+<Ability:ADVCOATDMG/></font> damage to bleeding, burning, acid-burn and poisoned targets"
TinySummary="+dmg to DOT-suffering enemies"
LootTooltip="This Advanced Pressurized Dispenser deals <font color='#3ABD23'><Ability:ADVCOATDMG/></font> additional damage to any enemy suffering from the following conditions: bleeding, burning, acid-burn and poisoned"

[Coating_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Pressurized Dispenser"
FriendlyNamePlural="Superior Pressurized Dispensers"
BriefSummary="Trace amounts of toxin coat the blade right before impact.<br/><font color='#3ABD23'>+<Ability:SUPCOATDMG/></font> damage to bleeding, burning, acid-burn and poisoned targets"
TinySummary="+dmg to DOT-suffering enemies"
LootTooltip="This Superior Pressurized Dispenser deals <font color='#3ABD23'><Ability:SUPCOATDMG/></font> additional damage to any enemy suffering from the following conditions: bleeding, burning, acid-burn and poisoned"

[Reflector_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Feedback Capacitor"
FriendlyNamePlural="Basic Feedback Capacitors"
BriefSummary="Riposte module: send <font color='#3ABD23'><Ability:BSCREFDMG/></font> damage back to shooter within <font color='#3ABD23'><Ability:BSCREFRANGE/></font> tiles."
TinySummary="Reflect damage"
LootTooltip="This blade modification allows you to reflect <font color='#3ABD23'><Ability:BSCREFDMG/></font> of incoming projectile or beam damage from attackers.<br/><Bullet/> The damage reflected will be converted to Melee type.<br/><Bullet/> Small amount of damage but cannot miss and goes through armor. <br/><Bullet/> Attacks must come within <font color='#3ABD23'>2 to <Ability:BSCREFRANGE/></font> tiles."

[Reflector_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Feedback Capacitor"
FriendlyNamePlural="Advanced Feedback Capacitors"
BriefSummary="Riposte module: send <font color='#3ABD23'><Ability:ADVREFDMG/></font> damage back to shooter within <font color='#3ABD23'><Ability:ADVREFRANGE/></font> tiles."
TinySummary="Reflect damage"
LootTooltip="This blade modification allows you to reflect <font color='#3ABD23'><Ability:ADVREFDMG/></font> of incoming projectile or beam damage from attackers.<br/><Bullet/> The damage reflected will be converted to Melee type.<br/><Bullet/> Small amount of damage but cannot miss and goes through armor. <br/><Bullet/> Attacks must come within <font color='#3ABD23'>2 to <Ability:ADVREFRANGE/></font> tiles."

[Reflector_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Feedback Capacitor"
FriendlyNamePlural="Superior Feedback Capacitors"
BriefSummary="Riposte module: send <font color='#3ABD23'><Ability:SUPREFDMG/></font> damage back to shooter within <font color='#3ABD23'><Ability:SUPREFRANGE/></font> tiles.
TinySummary="Reflect damage"
LootTooltip="This blade modification allows you to reflect <font color='#3ABD23'><Ability:SUPREFDMG/></font> of incoming projectile or beam damage from attackers.<br/><Bullet/> The damage reflected will be converted to Melee type.<br/><Bullet/> Small amount of damage but cannot miss and goes through armor. <br/><Bullet/> Attacks must come within <font color='#3ABD23'>2 to <Ability:SUPREFRANGE/></font> tiles."

[BasicReflector X2AbilityTemplate]
LocFriendlyName="Reflected!"
LocLongDescription="Deal <font color='#3ABD23'><Ability:BSCREFDMG/></font> damage back to attacker when hit from projectile or beam weapons."
LocHelpText="lochelptext"
LocFlyOverText="Reflected!"
LocPromotionPopupText="LocPromotionPopupText"

[AdvancedReflector X2AbilityTemplate]
LocFriendlyName="Reflected!"
LocLongDescription="Deal <font color='#3ABD23'><Ability:ADVREFDMG/></font> damage back to attacker when hit from projectile or beam weapons."
LocHelpText="lochelptext"
LocFlyOverText="Reflected!"
LocPromotionPopupText="LocPromotionPopupText"

[SuperiorReflector X2AbilityTemplate]
LocFriendlyName="Reflected!"
LocLongDescription="Deal <font color='#3ABD23'><Ability:SUPREFDMG/></font> damage back to attacker when hit from projectile or beam weapons."
LocHelpText="lochelptext"
LocFlyOverText="Reflected!"
LocPromotionPopupText="LocPromotionPopupText"

[BscHiltFlourish X2AbilityTemplate]
LocFriendlyName="Tracked!"
LocLongDescription="<font color='#3ABD23'><Ability:BSCHILTAIM/></font> bonus aim til the end of this round."
LocHelpText="<font color='#3ABD23'><Ability:BSCHILTAIM/></font> bonus aim til the end of this round."
LocFlyOverText="<font color='#3ABD23'>+<Ability:BSCHILTAIM/></font> aim"
LocPromotionPopupText="LocPromotionPopupText"

[AdvHiltFlourish X2AbilityTemplate]
LocFriendlyName="Tracked!"
LocLongDescription="<font color='#3ABD23'><Ability:ADVHILTAIM/></font> bonus aim til the end of this round."
LocHelpText="<font color='#3ABD23'><Ability:ADVHILTAIM/></font> bonus aim til the end of this round."
LocFlyOverText="<font color='#3ABD23'>+<Ability:ADVHILTAIM/></font> aim"
LocPromotionPopupText="LocPromotionPopupText"

[SupHiltFlourish X2AbilityTemplate]
LocFriendlyName="Tracked!"
LocLongDescription="<font color='#3ABD23'><Ability:SUPHILTAIM/></font> bonus aim til the end of this round."
LocHelpText="<font color='#3ABD23'><Ability:SUPHILTAIM/></font> bonus aim til the end of this round."
LocFlyOverText="<font color='#3ABD23'>+<Ability:SUPHILTAIM/></font> aim"
LocPromotionPopupText="LocPromotionPopupText"

[Hilt_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Basic Network Tracker"
FriendlyNamePlural="Basic Network Trackers"
BriefSummary="Non-Lost kills grants allies within <br/><font color='#3ABD23'><Ability:BSCHILTRADIUS/></font> tiles <font color='#3ABD23'>+<Ability:BSCHILTAIM/></font> aim til end of turn.<br/> <font color='#3ABD23'><Ability:BSCHILTUSES/></font> charges per mission."
TinySummary="+aim on kills"
LootTooltip="When you kill an enemy, this device scans the enemy Psionic signal, boosting allies within <font color='#3ABD23'><Ability:BSCHILTRADIUS/></font> tiles with <font color='#3ABD23'>+<Ability:BSCHILTAIM/></font> aim til the end of the turn. <br/><Bullet/><font color='#3ABD23'><Ability:BSCHILTUSES/></font> charges per mission. <br/><Bullet/>Does not work on Lost kills."

[Hilt_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Network Tracker"
FriendlyNamePlural="Advanced Network Trackers"
BriefSummary="Non-Lost kills grants allies within <br/><font color='#3ABD23'><Ability:ADVHILTRADIUS/></font> tiles <font color='#3ABD23'>+<Ability:ADVHILTAIM/></font> aim til end of turn.<br/> <font color='#3ABD23'><Ability:ADVHILTUSES/></font> charges per mission."
TinySummary="+aim on kills"
LootTooltip="When you kill an enemy, this device scans the enemy Psionic signal, boosting allies within <font color='#3ABD23'><Ability:ADVHILTRADIUS/></font> tiles with <font color='#3ABD23'>+<Ability:ADVHILTAIM/></font> aim til the end of the turn. <br/><Bullet/><font color='#3ABD23'><Ability:ADVHILTUSES/></font> charges per mission. <br/><Bullet/>Does not work on Lost kills."

[Hilt_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Network Tracker"
FriendlyNamePlural="Superior Network Trackers"
BriefSummary="Non-Lost kills grants allies within <br/><font color='#3ABD23'><Ability:SUPHILTRADIUS/></font> tiles <font color='#3ABD23'>+<Ability:SUPHILTAIM/></font> aim til end of turn.<br/> <font color='#3ABD23'><Ability:SUPHILTUSES/></font> charges per mission."
TinySummary="+aim on kills"
LootTooltip="When you kill an enemy, this device scans the enemy Psionic signal, boosting allies within <font color='#3ABD23'><Ability:SUPHILTRADIUS/></font> tiles with <font color='#3ABD23'>+<Ability:SUPHILTAIM/></font> aim til the end of the turn. <br/><Bullet/><font color='#3ABD23'><Ability:SUPHILTUSES/></font> charges per mission. <br/><Bullet/>Does not work on Lost kills."

